2/code/param/template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

// make sure to modify the 3 entries below before
// attempting to execute any OpenFOAM utility.
// See README for details

endTime         XXX;
deltaT          XXX;
writeInterval   XXX;

writeControl    XXX;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


// ************************************************************************* //

// functions 
// { 
//     #includeFunc  probes 
//     #includeFunc  singleGraph 
//     #includeFunc  forces 
//     #includeFunc  forceCoeffs 
// }
